In [7]:
list1 = [1,1.5,'hello world', False]
# ORDERED -> It preserves the sequence in which elements were inserted
# INDEXED -> we can access it via a[2] <- notation 
print(list1[-2]) # POS-> left to right, NEG -> right to left # LIST
print(list1) # THIS IS A LINKED LIST 
# GENERAL PURPOSE -> manage data, clean data, create n-dimension structures

hello world
[1, 1.5, 'hello world', False]

In [19]:
# BANANA, MANGO and MANGO, BANANA are same set!!!! \
set1 = {3,"Pikachu", "Mango", 23, False, 42, 23}
# UNIQUE REPRESENTATION
# ORDER DOES NOT MATTER! 
# IF ORDER DIDN'T MATTER, INDEX WASN't possible 
print(set1)
# making a list of items where only existence check matters

{False, 3, 'Mango', 42, 23, 'Pikachu'}

In [8]:
# TUPLES ARE READ ONLY -> once created, cannot be edited 
tup1 = (1,'Mango', 'banana')
print(tup1)
# ORDER is preserved
# no editing possible

(1, 'Mango', 'banana')

In [13]:
# DICTIONARY is KEY-VALUE PAIRS
# My key can be ANYTHING, value can be anything!
# JUST LIKE SET, UNIQUENESS matters! No two keys can be same!
dct = {'key1':23, False:42, -3:'hello world'}
print(dct[False])
print(dct[0])
# UNORDERED [no guarrantee that order will be followed], but INDEXABLE [with help of key-values]
# SET is single values, dictionary is key-value
# DICT -> 2 lists-> one list containing keys, one list containing values

42
42

In [17]:
for key, val in dct.items(): # two variables -> one in key, one in value
  print(str(key) + " *** " + str(val)) # DICTIONARY and LIST are 2 most critical DS that we will use

key1 *** 23
False *** 42
-3 *** hello world

In [0]:
# List -> store and clean data 
# Tuple -> store and pass READONLY data between functions or data structures
# Set -> to make sure that elements are present/exist
# Dictionary -> wherever i need match-the-following style data or table or hash table or map!

In [22]:
import numpy as np
import pandas as pd # pandas = panel dataframes = rectangular window-like data strcutures
# SERIES are special LISTS -> LISTS that are traveling in a direction [time, a vector or any direction]
ls = [1,2,3,np.nan]
srs = pd.Series(ls) # it is expecting a LIST that it will convert into series
print(ls)
print('***')
print(srs) # A SERIES has 2 lists -> first for index, 2nd for value 
# DICTIONARY was unordered but indexable, Series is both ordered and indexable 
# SERIES is a MULTIDIMENSION LIST
# NaN (some data processing happening), None (null pointer or end of line), NULL (its a value that came from a database)
# SERIES -> CONTINUOUS DATA 
# TIME SERIES -> Index is time  based
# LIST -> is just values, may not mandatorily follow any sequence or dimension

[1, 2, 3, nan]
***
0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [24]:
dates = pd.date_range('20190301', periods=10) # SERIES IS ALWAYS CONTINUOUS 
print(dates)

DatetimeIndex(['2019-03-01', '2019-03-02', '2019-03-03', '2019-03-04',
               '2019-03-05', '2019-03-06', '2019-03-07', '2019-03-08',
               '2019-03-09', '2019-03-10'],
              dtype='datetime64[ns]', freq='D')

In [103]:
# WHEN we have MULTIPLE columns following the same index, then we call it a DataFrame
# Marks in English, Marks in Math -> both are for 5 students 
# ROLL No. of these students was INDEX (not value), and VALUE was 2 columns -> Eng and Math
# TABULAR STRUCTURE
# RANGE is an inbuilt function to generate numbers from 0 to N -> [0,N)
dc = {'myCol':1, 'col2':dates, 'col3': range(10)}
df = pd.DataFrame(dc) # pass a dictionary-> KEY VALUE PAIR. EACH key represents a column
age = df.col3.to_numpy() # convert a column to list
print(age)
print(df)

[0 1 2 3 4 5 6 7 8 9]
   myCol       col2  col3
0      1 2019-03-01     0
1      1 2019-03-02     1
2      1 2019-03-03     2
3      1 2019-03-04     3
4      1 2019-03-05     4
5      1 2019-03-06     5
6      1 2019-03-07     6
7      1 2019-03-08     7
8      1 2019-03-09     8
9      1 2019-03-10     9

In [28]:
index = [1,2,3,4,'pika',6,7,8,10,11]
df.index = index
print(df)

      myCol       col2  col3
1         1 2019-03-01     0
2         1 2019-03-02     1
3         1 2019-03-03     2
4         1 2019-03-04     3
pika      1 2019-03-05     4
6         1 2019-03-06     5
7         1 2019-03-07     6
8         1 2019-03-08     7
10        1 2019-03-09     8
11        1 2019-03-10     9

In [0]:
ls = [1,2,3]
st = {1,2,3}
tp = (1,2,3)

ls2 = [ls, st, tp]
#tp2 = (ls,st,tp)
#st2 = {ls, st, tp} # INDEXING FAILED, and DS could not be created
# SETS SHOULD ONLY BE USED TO SHOW IF_EXISTS relation
# all objects should be of color GREEN or BLUE only
# if object.color in mySet:
#    myobjects.add(object)

In [32]:
df

      myCol       col2  col3
1         1 2019-03-01     0
2         1 2019-03-02     1
3         1 2019-03-03     2
4         1 2019-03-04     3
pika      1 2019-03-05     4
6         1 2019-03-06     5
7         1 2019-03-07     6
8         1 2019-03-08     7
10        1 2019-03-09     8
11        1 2019-03-10     9

In [34]:
df.head(3)

   myCol       col2  col3
1      1 2019-03-01     0
2      1 2019-03-02     1
3      1 2019-03-03     2

In [37]:
df.tail(2)

    myCol       col2  col3
10      1 2019-03-09     8
11      1 2019-03-10     9

In [42]:
ls[0:1] #  [ ) -> [ ] inclusion, ( ) exclusion-> [2,5) -> [2,3,4] 
# : acts like a wildcard -> from/to
ls = [1,2,3,4,5,6,6,7,7,232,22.3]
ls[:3] # [0,3)
ls[3:]
ls[5:9]

[6, 6, 7, 7]

In [43]:
ls[-3:]

[7, 232, 22.3]

In [44]:
ls[:-4]

[1, 2, 3, 4, 5, 6, 6]

In [46]:
a = [1,2,3,4,5]
a[3:11] # PYTHON IS VERY UNSTABLE LANGUAGE -> KEEP IT ONLY IN THE COMFORT ZONE
# OUT OF BOUNDS , IPython
# EXCEPTION WAS IN C++ or OS -> PYTHON HAS NO IDEA WHAT TO TELL YOU
# UNEXPECTED behavior

[4, 5]

In [47]:
df

      myCol       col2  col3
1         1 2019-03-01     0
2         1 2019-03-02     1
3         1 2019-03-03     2
4         1 2019-03-04     3
pika      1 2019-03-05     4
6         1 2019-03-06     5
7         1 2019-03-07     6
8         1 2019-03-08     7
10        1 2019-03-09     8
11        1 2019-03-10     9

In [0]:
stats = df.describe().T # MEAN-> SUM/N, MEDIAN-> CENTRAL DATA IN THE SET, MODE-> Most frequent

In [59]:
stats['max']

myCol    1.0
col3     9.0
Name: max, dtype: float64

In [62]:
df_temp = df.set_index('col2')
df_temp.sort_index(ascending=False)

            myCol  col3
col2
2019-03-10      1     9
2019-03-09      1     8
2019-03-08      1     7
2019-03-07      1     6
2019-03-06      1     5
2019-03-05      1     4
2019-03-04      1     3
2019-03-03      1     2
2019-03-02      1     1
2019-03-01      1     0

In [0]:
# BY COLUMN NAMES OR BY COLUMN INDEX
# LOCATION or by INDEXED LOCATION 
# 'myCol' or by [0]
# .loc and .iloc -> [row slicing, column slicing] -> 2:3 or :-3

In [69]:
df_temp.loc[:'20190307',['col3','myCol']] # NAMES
df_temp.iloc[:5,[1,0]] # INDEXES

            col3  myCol
col2
2019-03-01     0      1
2019-03-02     1      1
2019-03-03     2      1
2019-03-04     3      1
2019-03-05     4      1

In [74]:
df_temp[df_temp.index>'20190303'] #NUMPY -> MAGICAL library 
#df_temp.col3

            myCol  col3
col2
2019-03-04      1     3
2019-03-05      1     4
2019-03-06      1     5
2019-03-07      1     6
2019-03-08      1     7
2019-03-09      1     8
2019-03-10      1     9

In [0]:
# STRING and DS -> Are most difficult to manipulate 
# instead of manipulation, a new DS is created \
# when reverse string, xyz and converting into zyx, it will just create a new string called zyx
# COMPUTATION COMPLEXITY OF STRINGS and DS is VERY VERY HIGH 
# SHALLOW and DEEP COPY
# a=1, x is a shallow copy of a
# a=1, y is a DEEP copy of a
# make a change, a=2, then y will remain 1, while X will become 2
# PYTHON's default behavior is a shallow copy -> pointer copy pasting (C++ behavior)
df2 = df_temp.copy() # deep copy # PRODUCTION MUST, for tutorials, we'll be lazy
df3 = df_temp # shallow copy # ONLY THEORITICAL, python has a unexpected behavior on this on run time so .copy() is the 
# recommmended safe way

In [84]:
-df2 # -1 * df2
df4 = df3 - df2 # df3 + -1*df2
# ELEMENT WISE MATHEMATICAL OPS BETWEEN DFs
# df3.myCol-df2.myCol , df3.col3 -df2.col3 # ALL THIS MAGIC THANKS TO NUMPY
print(df4.index)
# LINE2: INDEX, LINE1: NAME of COLS
# COL2 -> INDEX

DatetimeIndex(['2019-03-01', '2019-03-02', '2019-03-03', '2019-03-04',
               '2019-03-05', '2019-03-06', '2019-03-07', '2019-03-08',
               '2019-03-09', '2019-03-10'],
              dtype='datetime64[ns]', name='col2', freq=None)

In [0]:
df = pd.DataFrame({'a':range(10),'b':42})
df_dirty = df[df>3]

In [105]:
df_dirty # fake df to demo missing values
# 2 things missing values:
# remove them
# or manage them -> replace them (logic? MEAN, MEDIAN, MODE, CUSTOM VALUE?)
xyz = df_dirty.dropna()
xyz
# replacing
wxy = df_dirty.fillna(value=42)
wxy

      a   b
0  42.0  42
1  42.0  42
2  42.0  42
3  42.0  42
4   4.0  42
5   5.0  42
6   6.0  42
7   7.0  42
8   8.0  42
9   9.0  42

In [99]:
df.mean()

a     4.5
b    42.0
dtype: float64

In [100]:
df.median()

a     4.5
b    42.0
dtype: float64

In [102]:
df.describe() 
# TRANSPOSE -> FUNCTION ON MATRICES
# ROWS become COLS, and COLS become ROWS

              a     b
count  10.00000  10.0
mean    4.50000  42.0
std     3.02765   0.0
min     0.00000  42.0
25%     2.25000  42.0
50%     4.50000  42.0
75%     6.75000  42.0
max     9.00000  42.0

In [106]:
# FUNCTIONS or PROCEDURES => have repetitive taks written at one place, and use again and again
def sum(a,b): # modularize, writing clean code. function is SLOW.
  c= a+b
  return c

sum(1,2)

3

In [107]:
# LAMBDA -> ONE LINE SHORT FUNCTION!
sm = lambda a,b: a+b # LOGIC to clean data frames!
sm(1,2)

3

In [115]:
xyz = [x for x in range(10)] # write the logic loop to generate numbers
dir(xyz)
xyz

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [121]:
# SERIES and PROPOGATE -> ITERATION 
# SINGULAR LOGIC of Propagation (NEXT), seed (initiator)
# Fibonacci
# -1 and 1 -> 0 -> 1-> 1-> 2-> 3 -> 5 -> 8.......
# every elements is sum of previous 2 numbers 
# SIMPLE CLASS -> general purpose
# SPECIAL CLASSES -> SERIES and PROPAGATION
# 2 4 6 8 ?
# iter -> this.seed = 2, next -> this.value = this.seed + 2, return this.value
# __ python defined, ALL_CAPS user defined
class Fibonacci: # __ before __ after -> PYTHON PREDEFINED OBJECTS
  def __iter__(this):
    this.first = -1
    this.second = 1
    return this
  def __next__(this):
    this.result = this.first + this.second
    this.first = this.second
    this.second = this.result
    return this.result 

myFiboSeries = Fibonacci()
myiter = iter(myFiboSeries)
print(next(myiter))
print(next(myiter))
print(next(myiter))
print(next(myiter))
print(next(myiter))
print(next(myiter))

0
1
1
2
3
5

In [122]:
for x in range(10):
  print(next(myiter))

8
13
21
34
55
89
144
233
377
610